xuantruong262/stm32_public_workspace/Stm32F1/Snake_Game/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TFT_CLK_Pin GPIO_PIN_13
#define TFT_CLK_GPIO_Port GPIOB
#define TFT_SDI_Pin GPIO_PIN_14
#define TFT_SDI_GPIO_Port GPIOB
#define TFT_SDA_Pin GPIO_PIN_15
#define TFT_SDA_GPIO_Port GPIOB
#define TFT_CS_Pin GPIO_PIN_8
#define TFT_CS_GPIO_Port GPIOA
#define TFT_RS_Pin GPIO_PIN_9
#define TFT_RS_GPIO_Port GPIOA
#define TFT_TransMode_Pin GPIO_PIN_11
#define TFT_TransMode_GPIO_Port GPIOA
#define Button_Up_Pin GPIO_PIN_3
#define Button_Up_GPIO_Port GPIOB
#define Button_Up_EXTI_IRQn EXTI3_IRQn
#define Button_Right_Pin GPIO_PIN_4
#define Button_Right_GPIO_Port GPIOB
#define Button_Right_EXTI_IRQn EXTI4_IRQn
#define Button_Left_Pin GPIO_PIN_5
#define Button_Left_GPIO_Port GPIOB
#define Button_Left_EXTI_IRQn EXTI9_5_IRQn
#define Button_Down_Pin GPIO_PIN_6
#define Button_Down_GPIO_Port GPIOB
#define Button_Down_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
